000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ГородаДоставки/ГородаДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГородаДоставки</name>
  <attributes>
    <name>НаименованиеRU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Область</name>
    <type>
      <types>CatalogRef.Области</types>
    </type>
  </attributes>
  <attributes>
    <name>Район</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CityID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОператорДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторSettlement</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешCity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ОператорыДоставки/ОператорыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОператорыДоставки</name>
  <enumValues>
    <name>ВнутренняяЛогистика</name>
  </enumValues>
  <enumValues>
    <name>НоваяПочта</name>
  </enumValues>
  <enumValues>
    <name>MeestExpress</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаКурьером</name>
  </enumValues>
  <enumValues>
    <name>МеждународнаяДоставка</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ГородаДоставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Найти город по имени.
// 
// Параметры:
//  НаименованиеГорода - Строка - Наименование города в виде строки
//  ОператорДоставки - ПеречислениеСсылка.ОператорыДоставки - Оператор доставки
// 
// Возвращаемое значение:
// СправочникСсылка.ГородаДоставки, Строка - Ссылка на город доставки
//  
Функция НайтиГород(НаименованиеГорода, ОператорДоставки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ГородаДоставки.Ссылка
		|ИЗ
		|	Справочник.ГородаДоставки КАК ГородаДоставки
		|ГДЕ
		|	ГородаДоставки.ОператорДоставки = &ОператорДоставки
		|	И (ГородаДоставки.НаименованиеRU = &НаименованиеГорода
		|	ИЛИ ГородаДоставки.Наименование = &НаименованиеГорода)";
	
	Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
	Запрос.УстановитьПараметр("НаименованиеГорода", СокрЛП(НаименованиеГорода));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		Результат = НаименованиеГорода;

	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Найти город ref.
// 
// Параметры:
//  ГородRef - Строка - Город ref
//  ОператорДоставки - ПеречислениеСсылка.ОператорыДоставки - Оператор доставки
// 
// Возвращаемое значение:
// СправочникСсылка.ГородаДоставки, Неопределено - Ссылка на город доставки
//  
Функция НайтиГородRef(ГородRef, ОператорДоставки) Экспорт

	Если ПустаяСтрока(ГородRef) Или Не ОператорДоставки = Перечисления.ОператорыДоставки.НоваяПочта Тогда 
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ГородаДоставки.Ссылка
		|ИЗ
		|	Справочник.ГородаДоставки КАК ГородаДоставки
		|ГДЕ
		|	ГородаДоставки.ОператорДоставки = &ОператорДоставки
		|	И (ГородаДоставки.ИдентификаторSettlement = &ГородRef
		|	ИЛИ ГородаДоставки.Идентификатор = &ГородRef)";
	
	Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
	Запрос.УстановитьПараметр("ГородRef", СокрЛП(ГородRef));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		Результат = ОбменНПСервер.ДобавитьГородНовый(ГородRef);
		
		Если Не ТипЗнч(Результат) = Тип("СправочникСсылка.ГородаДоставки") Тогда 
			Результат = Неопределено;
		КонецЕсли;

	КонецЕсли;
	
	Возврат Результат;

КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли
